tutorials/RAS/variableHeightDuct/constant/bedloadProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      bedloadProperties;
}

// ************************** sediment properties ************************** //

sedimentBed            on;  // on or off

bedMotion              on;

sedimentBedPatches     (bed);

ABorder                1;

fixedFaPatches         (inletFa outletFa);

bedloadModel
{
    type               Nielsen;
    slopeCorrection    off;

    avalanche          on;
    Qav                3e-4;
}

criticalShieldsModel
{
    type               fixedValue;
    value              0.05;
    slopeCorrection    off;
}

rigidBed               on;

// ************************************************************************* //
