tutorials/RAS/variableHeightDuct/constant/suspensionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      suspensionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

suspension     on;

fallModel
{
    type   Fredsoe;
}

hindranceModel
{
    type   none;
}

wallDiffusivity
{
    alpha      5e-6;
    beta       5;
}

CsbMax         0.15;

// ************************************************************************* //
